///*
//0为空气 1为墙壁 3为目的地 4为箱子 6为玩家 7为箱子和目的地重合 9为人和目的地重合
//00111000
//00131000
//00101111
//11140431
//13046111
//11114100
//00011100
//*/
//#include <stdio.h>
//#include <conio.h>
//#include <stdlib.h>
//
//
////     行 列 多维数组
//int Map[4][8][8] = {
//{
//0,0,1,1,1,0,0,0,
//0,0,1,3,1,0,0,0,
//0,0,1,0,1,1,1,1,
//1,1,1,4,0,4,3,1,
//1,3,0,4,6,1,1,1,
//1,1,1,1,4,1,0,0,
//0,0,0,1,3,1,0,0,
//0,0,0,1,1,1,0,0
//},
//{
//0,0,0,1,1,1,1,0,
//0,0,0,1,3,3,1,0,
//0,1,1,1,0,0,1,0,
//0,1,3,4,4,4,1,0,
//0,1,1,1,6,0,1,1,
//0,0,0,1,0,4,3,1,
//0,0,0,1,0,1,1,1,
//0,0,0,1,1,1,0,0
//},
//{
//0,0,1,1,1,1,0,0,
//0,0,1,3,3,1,0,0,
//0,1,1,0,0,1,1,0,
//1,3,4,4,4,4,3,1,
//1,1,0,6,0,0,1,1,
//0,1,1,4,1,1,1,0,
//0,0,1,3,0,1,0,0,
//0,0,1,1,1,1,0,0
//},
//{
//1,1,1,1,1,1,1,0,
//1,3,0,0,0,0,1,0,
//1,1,1,4,1,0,1,1,
//0,0,1,0,4,0,3,1,
//0,0,1,0,6,0,1,1,
//0,0,1,4,1,1,1,0,
//0,0,1,3,1,0,0,0,
//0,0,1,1,1,0,0,0
//},
//};
//int g = 0; //当前关卡
//int g_boxNum[4] = { 4,4,5,3 }; //存储箱子的个数
//
////1。绘制游戏地图
//void DrawMap(int Map[4][8][8]) {
//	for (int i = 0; i < 8; i++) {
//		for (int j = 0; j < 8; j++) {
//			//printf("%d\t", Map[i][j]);
//			switch (Map[g][i][j])
//			{
//			case 0:printf("  "); break;//空地
//			case 1:printf("■"); break;//墙壁
//			case 3:printf("☆"); break;//目的地
//			case 4:printf("□"); break;//箱子
//			case 6:printf("♀"); break;//人物
//			case 7:printf("□"); break;//箱子在目的地
//			case 9:printf("♀"); break;//人物在目的地
//			}
//		}
//		printf("\n");
//	}
//}
//
//
//int main() {
//	/*     行 列 多维数组
//	int Map[8][8] =
//	{
//	0,0,1,1,1,0,0,0,
//	0,0,1,3,1,0,0,0,
//	0,0,1,0,1,1,1,1,
//	1,1,1,4,0,4,3,1,
//	1,3,0,4,6,1,1,1,
//	1,1,1,1,4,1,0,0,
//	0,0,0,1,3,1,0,0,
//	0,0,0,1,1,1,0,0
//	};*/
//
//	while (1) {
//		system("cls");
//		DrawMap(Map);
//		int count = 0;
//		//移动角色 1.确定位置
//		int i, j;
//		for (i = 0; i < 8; i++) {
//			for (j = 0; j < 8; j++) {
//				if (Map[g][i][j] == 6 || Map[g][i][j] == 9) break;
//			}
//			if (Map[g][i][j] == 6 || Map[g][i][j] == 9) break;
//		}
//
//		printf("坐标：(%d,%d)\n", i, j);
//
//		//2.从键盘获取字符 确定人物移动的方位
//		int input = _getch(); //从键盘获取字符存储到input中
//
//		switch (input) {
//		case 'w':
//			//判断角色前方是空地或目的地，表示可以移动
//			if (Map[g][i - 1][j] == 0 || Map[g][i - 1][j] == 3) {
//				Map[g][i - 1][j] += 6;
//				Map[g][i][j] -= 6;
//			}
//			//判断角色的前方是箱子或箱子在目的地
//			else if (Map[g][i - 1][j] == 4 || Map[g][i - 1][j] == 7) {
//				if (Map[g][i - 2][j] == 0 || Map[g][i - 2][j] == 3) {
//					Map[g][i - 2][j] += 4;
//					Map[g][i - 1][j] += 2;
//					Map[g][i][j] -= 6;
//				}
//			}
//			break;
//		case 's':
//			//判断角色前方是空地或目的地，表示可以移动
//			if (Map[g][i + 1][j] == 0 || Map[g][i + 1][j] == 3) {
//				Map[g][i + 1][j] += 6;
//				Map[g][i][j] -= 6;
//			}
//			//判断角色的前方是箱子或箱子在目的地
//			else if (Map[g][i + 1][j] == 4 || Map[g][i + 1][j] == 7) {
//				if (Map[g][i + 2][j] == 0 || Map[g][i + 2][j] == 3) {
//					Map[g][i + 2][j] += 4;
//					Map[g][i + 1][j] += 2;
//					Map[g][i][j] -= 6;
//				}
//			}
//			break;
//		case 'a':
//			//判断角色前方是空地或目的地，表示可以移动
//			if (Map[g][i][j-1] == 0 || Map[g][i][j-1] == 3) {
//				Map[g][i][j-1] += 6;
//				Map[g][i][j] -= 6;
//			}
//			//判断角色的前方是箱子或箱子在目的地
//			else if (Map[g][i][j-1] == 4 || Map[g][i][j-1] == 7) {
//				if (Map[g][i][j-2] == 0 || Map[g][i][j-2] == 3) {
//					Map[g][i][j-2] += 4;
//					Map[g][i][j-1] += 2;
//					Map[g][i][j] -= 6;
//				}
//			}
//			break;
//		case 'd':
//			//判断角色前方是空地或目的地，表示可以移动
//			if (Map[g][i][j + 1] == 0 || Map[g][i][j + 1] == 3) {
//				Map[g][i][j + 1] += 6;
//				Map[g][i][j] -= 6;
//			}
//			//判断角色的前方是箱子或箱子在目的地
//			else if (Map[g][i][j + 1] == 4 || Map[g][i][j + 1] == 7) {
//				if (Map[g][i][j + 2] == 0 || Map[g][i][j + 2] == 3) {
//					Map[g][i][j + 2] += 4;
//					Map[g][i][j + 1] += 2;
//					Map[g][i][j] -= 6;
//				}
//			}
//			break;
//		}
//
//		for (i = 0; i < 8; i++) {
//			for (j = 0; j < 8; j++) {
//				if (Map[g][i][j] == 7) count++;
//			}
//		}
//
//		if (count == g_boxNum[g]) {
//			system("cls");
//			DrawMap(Map);
//
//			if (g < sizeof(g_boxNum) / sizeof(g_boxNum[0]) - 1) {
//				g++; //下一关
//			}
//			else {
//				printf("通关！！！\n");
//				break;
//			}
//		}
//	}
//	return 0;
//}